In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj=Series(range(4), index=['d', 'a', 'b', 'c']);
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [15]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
        columns=['d', 'a', 'b', 'c']) 
# it also works with '1' and '3' insted of 'three' and 'one'

In [13]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [14]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [8]:
frame.sort_index(axis=1) # sord by cols labels

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [16]:
frame.sort_index(axis=1, ascending=False) # sort in desc order by cols

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [22]:
obj=Series([4,np.nan, 7,-3,2]); # sort Series by values, not by index
obj.sort_values() 

# all NaN are sorted at the end

3   -3.0
4    2.0
0    4.0
2    7.0
1    NaN
dtype: float64

In [23]:
frame=DataFrame({'b':[4,7,-3,2], 'a': [0,1,0,1]});
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [25]:
frame.sort_values(by='b') # sorting DF by vals in one col

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [29]:
frame.sort_values(by=['a', 'b']) # sort by multiple columns

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [ ]:
# Axis indexes with duplicate values:

In [30]:
obj=Series(range(5), index=['a', 'a', 'b', 'b', 'c']);
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [31]:
obj.index.is_unique # check for uniqness of indexes

False

In [32]:
obj['a']

a    0
a    1
dtype: int64

In [33]:
obj['c']

4

In [35]:
df=DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b']);
df

          0         1         2
a -0.765689 -0.087610  0.277869
a -0.239001 -0.164860  1.643573
b -0.578661 -0.446409  1.243635
b  0.268563 -1.470036  0.481407

In [37]:
df.ix['b']

          0         1         2
b -0.578661 -0.446409  1.243635
b  0.268563 -1.470036  0.481407

In [ ]:
# Summarizing and Computing Descriptive Statistics:

In [41]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
                index=['a', 'b', 'c', 'd'],
                columns=['one', 'two']);

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [42]:
df.sum() # returns sum of cols as in xl

one    9.25
two   -5.80
dtype: float64

In [43]:
df.sum(axis=1) # suming by rows

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [44]:
df.mean(axis=1) #mean by rows

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [45]:
df.mean(axis=1, skipna=False) 
# note: the mean of 1,4 and NaN in row a is now NaN

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [49]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [47]:
df.idxmax() #idx b holds the max value in the col name 'one'

one    b
two    d
dtype: object

In [48]:
df.idxmin()

one    d
two    b
dtype: object

In [54]:
df.max()

one    7.1
two   -1.3
dtype: float64

In [50]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [58]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [59]:
df.describe() # desc stat by cols

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.300000

In [53]:
df.max()

one    7.1
two   -1.3
dtype: float64

In [62]:
df2 = DataFrame([[1.4, 6], [7.1, 4.5],
                [8, 9], [0.75, 1.3]],
                index=['a', 'b', 'c', 'd'],
                columns=['one', 'two']);

df2 # when there are no NaN vals, percentiles are present

    one  two
a  1.40  6.0
b  7.10  4.5
c  8.00  9.0
d  0.75  1.3

In [63]:
df2.describe()

            one       two
count  4.000000  4.000000
mean   4.312500  5.200000
std    3.765717  3.203123
min    0.750000  1.300000
25%    1.237500  3.700000
50%    4.250000  5.250000
75%    7.325000  6.750000
max    8.000000  9.000000